GT3/setup_TM/LES-smagorinsky/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {

        solver          PCG;
	preconditioner 	DIC;
	tolerance	1e-6;
        relTol		0.01;

/*
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.01;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        cacheAgglomeration on;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels     1;
*/
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0.0;
    }

    "(U|k|nuTilda).*"
    {
/*
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-08;
        relTol          0;
*/

        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;

	minIter		3;
    }
}

PIMPLE
{
    nCorrectors     3;
    nNonOrthogonalCorrectors 1;
    momentumPredictor yes;
}

// ************************************************************************* //
